Revit 2024 API
SiteLocation.Elevation Property
 The elevation of the site location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014 UR2
Syntax
C#
public double Elevation { get; }
Visual Basic
Public ReadOnly Property Elevation As Double
	Get
Visual C++
public:
property double Elevation {
	double get ();
}
See Also
SiteLocation Class
Autodesk.Revit.DB Namespace